/* Title for event birthday (with a name) */
"%@\\U2019s Birthday" = "%@";

/* Title for event birthday (without a name) */
"Birthday" = "Syntymäpäivä";

"FACEBOOK_CALENDAR_NAME" = "Facebook-tapahtumat";

/* default calendar name */
"DEFAULT_CALENDAR_NAME" = "Kalenteri";

/* default reminders calendar name */
"DEFAULT_TASK_CALENDAR_NAME" = "Muistutukset";
// Also this one, sadly.  See 9806767 and 9696624
"Reminders" = "Muistutukset";

/* Default name for an event/reminder alarm */
"DEFAULT_REMINDER_NAME" = "Muistutus";

/* Errors, returned as part of EKError object. Generally only for developers, but they might appear in UI.*/
"EVENT_NOT_MUTABLE_ERROR" = "Tapahtumaa ei voida muokata.";

"NO_CALENDAR_ERROR" = "Kalentereita ei ole asetettu.";

"NO_START_DATE_ERROR" = "Aloituspäivää ei ole asetettu.";

"NO_END_DATE_ERROR" = "Lopetuspäivää ei ole asetettu.";

"DATES_INVERTED_ERROR" = "Aloituspäivän tulee olla ennen lopetuspäivää.";

"UNEXPECTED_ERROR" = "Tapahtui odottamaton virhe.";

"CALENDAR_SOURCE_CANNOT_BE_MODIFIED" = "Kalenteria ei voida siirtää toiselle tilille.";


"CALENDAR_READ_ONLY_ERROR" = "Kalenteri on kirjoitussuojattu.";

"DURATION_EXCEEDS_RECURRENCE_ERROR" = "Tapahtuma on liian pitkä toistettavaksi näin usein.";

"ALARM_EXCEEDS_RECURRENCE_ERROR" = "Tapahtuma toistuu ennen muistutusta.";

"START_DATE_FUTURE_ERROR" = "Tapahtuma liian kaukana tulevaisuudessa.";

"OCCURRENCE_COLLISION_ERROR" = "Tapahtuman toinen esiintymä osuu samalle päivälle.";

"INVITES_CANNOT_MOVE_ERROR" = "Kutsuja ei voida siirtää toiseen kalenteriin.";

"CANNOT_GEOCODE_LOCATION_ERROR" = "Tämän muistutuksen sijaintia ei voitu geokoodata osoitteeseen hälytyksen laukaisemista varten.";

/* meaningless to end users, but useful for coders. It means the event is being used with the wrong database (store). */
"WRONG_STORE_ERROR" = "Väärä tapahtumatietokanta tapahtumalle.";

/* developer error */
"SPAN_ERROR" = "Määriteltiin virheellinen väli.";

"CALENDAR_HAS_NO_SOURCE" = "Kalenterilla ei ole lähdettä";

"DOES_NOT_ALLOW_RECURRENCE_CHANGES" = "Toistokenttää ei voida muuttaa.";

"DOES_NOT_ALLOW_ALARM_CHANGES" = "Hälytyksiä ei voida muuttaa.";

"DOES_NOT_ALLOW_ATTENDEE_CHANGES" = "Osallistujia ei voida muuttaa";

"CALENDAR_IMMUTABLE" = "Kalenteria ei voida muuttaa tai poistaa.";

"STRUCTURED_LOCATIONS_NOT_SUPPORTED" = "Tämä tili ei tue sijaintien paikkatietoja.";

"ACTIONS_NOT_SUPPORTED" = "Tämä tili ei tue toimintoja.";

"REMINDER_LOCATIONS_NOT_SUPPORTED" = "Tämä tili ei tue muistutusten sijainteja.";

"ALARM_PROXIMITY_NOT_SUPPORTED" = "Tämä tili ei tue tapahtuman läheisyyteen perustuvia hälytyksiä.";

"RECURRING_TASK_REQUIRES_DUE_DATE_ERROR" = "Toistuvalla muistutuksella pitää olla määräpäivä.";

"SOURCE_PROHIBITS_CALENDAR_ADD_DELETE" = "Tili ei salli lisättäviä tai poistettavia kalentereita.";

"CALENDAR_DOES_NOT_ALLOW_EVENTS" = "Kalenteriin ei voida lisätä tapahtumia.";

"CALENDAR_DOES_NOT_ALLOW_REMINDERS" = "Kalenteriin ei voida lisätä muistutuksia.";

"SOURCE_DOES_NOT_ALLOW_REMINDERS" = "Tili ei tue muistutuksia.";

"PRIORITY_IS_INVALID" = "Tärkeyden on oltava 0:n ja 9:n välillä.";

"INVALID_ENTITY_TYPE" = "Virheellinen EKEntityType.";
